fixtures/vcr_cassettes/features/project_pledge_spec/Paying_with_a_declined_credit_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=100000&currency=usd&card=tok_03rFEbvuxGhKBt&description=CloudFunded%20pledge%20to%20Magical%20Mystery%20Tour1
    headers:
      Accept:
      - ! '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.7.0
      Authorization:
      - Bearer YM3s0MpK2QhAdVLomUTnOjMVblutovoZ
      X-Stripe-Client-User-Agent:
      - ! '{"bindings_version":"1.7.0","lang":"ruby","lang_version":"1.9.3 p125 (2012-02-16)","platform":"x86_64-darwin11.3.0","publisher":"stripe","uname":"Darwin
        Alaya.local 11.4.0 Darwin Kernel Version 11.4.0: Mon Apr  9 19:32:15 PDT 2012;
        root:xnu-1699.26.8~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '116'
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Thu, 26 Jul 2012 05:10:14 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '152'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
    body:
      encoding: US-ASCII
      string: ! "{\n  \"error\": {\n    \"charge\": \"ch_03rFS2SUQOpUiN\",\n    \"code\":
        \"card_declined\",\n    \"message\": \"Your card was declined.\",\n    \"type\":
        \"card_error\"\n  }\n}\n"
    http_version: 
  recorded_at: Thu, 26 Jul 2012 05:10:17 GMT
recorded_with: VCR 2.2.2
